BINDTI(
  (drug_extractor): MolecularGCN(
    (init_transform): Linear(in_features=75, out_features=128, bias=False)
    (gnn): GCN(
      (gnn_layers): ModuleList(
        (0): GCNLayer(
          (graph_conv): GraphConv(in=128, out=128, normalization=none, activation=<function relu at 0x7feedf939c20>)
          (dropout): Dropout(p=0.0, inplace=False)
          (res_connection): Linear(in_features=128, out_features=128, bias=True)
          (bn_layer): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (1): GCNLayer(
          (graph_conv): GraphConv(in=128, out=128, normalization=none, activation=<function relu at 0x7feedf939c20>)
          (dropout): Dropout(p=0.0, inplace=False)
          (res_connection): Linear(in_features=128, out_features=128, bias=True)
          (bn_layer): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
        (2): GCNLayer(
          (graph_conv): GraphConv(in=128, out=128, normalization=none, activation=<function relu at 0x7feedf939c20>)
          (dropout): Dropout(p=0.0, inplace=False)
          (res_connection): Linear(in_features=128, out_features=128, bias=True)
          (bn_layer): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
        )
      )
    )
  )
  (protein_extractor): ProteinACmix(
    (embedding): Embedding(26, 128, padding_idx=0)
    (acmix1): ACmix(
      (conv1): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv2): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv3): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv_p): Conv2d(2, 16, kernel_size=(1, 1), stride=(1, 1))
      (pad_att): ReflectionPad2d((0, 0, 0, 0))
      (unfold): Unfold(kernel_size=1, dilation=1, padding=0, stride=1)
      (softmax): Softmax(dim=1)
      (fc): Conv2d(24, 9, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (dep_conv): Conv2d(144, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=16, bias=False)
    )
    (bn1): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (acmix2): ACmix(
      (conv1): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv2): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv3): Conv2d(128, 128, kernel_size=(1, 1), stride=(1, 1))
      (conv_p): Conv2d(2, 16, kernel_size=(1, 1), stride=(1, 1))
      (pad_att): ReflectionPad2d((0, 0, 0, 0))
      (unfold): Unfold(kernel_size=1, dilation=1, padding=0, stride=1)
      (softmax): Softmax(dim=1)
      (fc): Conv2d(24, 9, kernel_size=(1, 1), stride=(1, 1), bias=False)
      (dep_conv): Conv2d(144, 128, kernel_size=(3, 3), stride=(1, 1), padding=(1, 1), groups=16, bias=False)
    )
    (bn2): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
  )
  (cross_intention): BiIntention(
    (drug_intention): ModuleList(
      (0): IntentionBlock(
        (norm_layer): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
        (attn): Intention(
          (wq): Linear(in_features=128, out_features=128, bias=True)
          (wk): Linear(in_features=128, out_features=128, bias=True)
          (wv): Linear(in_features=128, out_features=128, bias=True)
          (softmax): Softmax(dim=-2)
          (out): Linear(in_features=128, out_features=128, bias=True)
        )
        (softmax): Softmax(dim=-2)
      )
    )
    (protein_intention): ModuleList(
      (0): IntentionBlock(
        (norm_layer): LayerNorm((128,), eps=1e-05, elementwise_affine=True)
        (attn): Intention(
          (wq): Linear(in_features=128, out_features=128, bias=True)
          (wk): Linear(in_features=128, out_features=128, bias=True)
          (wv): Linear(in_features=128, out_features=128, bias=True)
          (softmax): Softmax(dim=-2)
          (out): Linear(in_features=128, out_features=128, bias=True)
        )
        (softmax): Softmax(dim=-2)
      )
    )
    (attn_drug): SelfAttention(
      (wq): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (wk): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (wv): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (attn): MultiheadAttention(
        (out_proj): NonDynamicallyQuantizableLinear(in_features=128, out_features=128, bias=True)
      )
    )
    (attn_protein): SelfAttention(
      (wq): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (wk): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (wv): Sequential(
        (0): Linear(in_features=128, out_features=128, bias=True)
        (1): Dropout(p=0.0, inplace=False)
      )
      (attn): MultiheadAttention(
        (out_proj): NonDynamicallyQuantizableLinear(in_features=128, out_features=128, bias=True)
      )
    )
  )
  (mlp_classifier): MLPDecoder(
    (fc1): Linear(in_features=256, out_features=512, bias=True)
    (bn1): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc2): Linear(in_features=512, out_features=512, bias=True)
    (bn2): BatchNorm1d(512, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc3): Linear(in_features=512, out_features=128, bias=True)
    (bn3): BatchNorm1d(128, eps=1e-05, momentum=0.1, affine=True, track_running_stats=True)
    (fc4): Linear(in_features=128, out_features=1, bias=True)
  )
)